# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

In [1]:
import pandas as pd
import cleaning_functions as cf

In [2]:
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv"
df = pd.read_csv(url)
df.head(1)

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.21696,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.8,Four-Door Car,Medsize,NaN

In [3]:
cf.clean_column_names(df)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_open_complaints,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,...,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10905,10905,FE99816,Nevada,15563.369440,No,Premium,Bachelor,1/19/11,Unemployed,F,...,NaN,7,Personal Auto,Personal L1,Offer3,Web,1214.400000,Luxury Car,Medsize,A
10906,10906,KX53892,Oregon,5259.444853,No,Basic,College,1/6/11,Employed,F,...,0.0,6,Personal Auto,Personal L3,Offer2,Branch,273.018929,Four-Door Car,Medsize,A
10907,10907,TL39050,Arizona,23893.304100,No,Extended,Bachelor,2/6/11,Employed,F,...,0.0,2,Corporate Auto,Corporate L3,Offer1,Web,381.306996,Luxury SUV,Medsize,NaN
10908,10908,WA60547,California,11971.977650,No,Premium,College,2/13/11,Employed,F,...,4.0,6,Personal Auto,Personal L1,Offer1,Branch,618.288849,SUV,Medsize,A
10909,10909,IV32877,NaN,6857.519928,NaN,Basic,Bachelor,1/8/11,Unemployed,M,...,0.0,3,Personal Auto,Personal L1,Offer4,Web,1021.719397,SUV,Medsize,NaN

In [4]:
new_df_1 = df.groupby("response")
new_df_1 = new_df_1.get_group("Yes")

In [5]:
new_df_1 = new_df_1.loc[new_df_1["total_claim_amount"] >1000]

In [6]:
new_df_1.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_open_complaints,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type
189,189,OK31456,California,11009.130490,Yes,Premium,Bachelor,1/24/11,Employed,F,...,0.0,1,Corporate Auto,Corporate L3,Offer2,Agent,1358.400000,Luxury Car,Medsize,NaN
236,236,YJ16163,Oregon,11009.130490,Yes,Premium,Bachelor,1/24/11,Employed,F,...,0.0,1,Special Auto,Special L3,Offer2,Agent,1358.400000,Luxury Car,Medsize,A
419,419,GW43195,Oregon,25807.063000,Yes,Extended,College,2/13/11,Employed,F,...,1.0,2,Personal Auto,Personal L2,Offer1,Branch,1027.200000,Luxury Car,Small,A
442,442,IP94270,Arizona,13736.132500,Yes,Premium,Master,2/13/11,Disabled,F,...,0.0,8,Personal Auto,Personal L2,Offer1,Web,1261.319869,SUV,Medsize,A
587,587,FJ28407,California,5619.689084,Yes,Premium,High School or Below,1/26/11,Unemployed,M,...,0.0,1,Personal Auto,Personal L1,Offer2,Web,1027.000029,SUV,Medsize,A

2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

In [7]:
new_df_2 = df.loc[df["response"] == "Yes"]
new_df_2 = df.groupby(["policy_type", "gender"]).agg({"total_claim_amount": "mean"}).reset_index()
new_df_2

      policy_type gender  total_claim_amount
0  Corporate Auto      F          397.799287
1  Corporate Auto      M          462.223565
2   Personal Auto      F          413.239658
3   Personal Auto      M          459.919476
4    Special Auto      F          458.139623
5    Special Auto      M          420.355202

In [8]:
new_df_2.describe()

       total_claim_amount
count            6.000000
mean           435.279469
std             28.174286
min            397.799287
25%            415.018544
50%            439.247413
75%            459.474513
max            462.223565

In [9]:
#The maximum avg total claim amount (462) originates by males with corporate auto policies.
#All avg of total claimed amounts are higher for males except for the special auto policy, which is higher for females.
#Females with corporate auto policy have the least avg total claim amount (397).

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [10]:
df["state"].value_counts()

state
California    3552
Oregon        2909
Arizona       1937
Nevada         993
Washington     888
Name: count, dtype: int64

In [11]:
new_df_3 = df.groupby(["state"]).agg({"customer": "count"}).reset_index()

In [12]:
new_df_3.head()

        state  customer
0     Arizona      1937
1  California      3552
2      Nevada       993
3      Oregon      2909
4  Washington       888

In [13]:
#All states have more than 500 customers.
#However, if they didn't, we'd do the following step.

In [14]:
#new_df_3 = new_df_3.loc[new_df_3["customer"] > 500]

In [15]:
#new_df_3.head()

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [16]:
new_df_4 = df.groupby(["education", "gender"]).agg({"customer_lifetime_value": ["max", "min", "median"]}).reset_index()
new_df_4

              education gender customer_lifetime_value               \
                                                   max          min
0              Bachelor      F             73225.95652  1904.000852
1              Bachelor      M             67907.27050  1898.007675
2               College      F             61850.18803  1898.683686
3               College      M             61134.68307  1918.119700
4                Doctor      F             44856.11397  2395.570000
5                Doctor      M             32677.34284  2267.604038
6  High School or Below      F             55277.44589  2144.921535
7  High School or Below      M             83325.38119  1940.981221
8                Master      F             51016.06704  2417.777032
9                Master      M             50568.25912  2272.307310


        median
0  5640.505303
1  5548.031892
2  5623.611187
3  6005.847375
4  5332.462694
5  5577.669457
6  6039.553187
7  6286.731006
8  5729.855012
9  5579.099207

In [17]:
new_df_4.describe()

      customer_lifetime_value
                          max          min       median
count               10.000000    10.000000    10.000000
mean             58183.870817  2105.797305  5736.336632
std              14610.072221   217.541538   286.339868
min              32677.342840  1898.007675  5332.462694
25%              50680.211100  1907.530564  5578.026895
50%              58206.064480  2042.951378  5632.058245
75%              66392.999882  2271.131492  5936.849284
max              83325.381190  2417.777032  6286.731006

In [18]:
#The max clv (83325) corresponds to males with a highschool or below level of education.
#The min clv (1898.007) corresponds to males with a bachelor.
#WE can see that the clv is always higher for females except for the clv of males with a highscholl or below level of education.

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

In [19]:
#df["effective_to_date"].head()

In [20]:
#df["month"] = df["effective_to_date"] = df["effective_to_date"].apply(lambda x: x.split("/")[0])

In [21]:
#df["month"].value_counts()

In [22]:
#bonus_df = df.groupby(["state", "month"]).agg({"number_of_policies": "count"}).reset_index()

In [23]:
#bonus_df

In [24]:
#pivot_df = bonus_df.pivot(index="state", columns="month", values="number_of_policies")

In [25]:
#pivot_df

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

In [26]:
#sorted_bonus_df = bonus_df.sort_values("number_of_policies", ascending=False)

In [27]:
#sorted_bonus_df.reset_index()

In [28]:
#top_3_df = sorted_bonus_df.iloc[:6].reset_index()

In [29]:
#top_3_df.drop("index", axis=1)

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

In [30]:
#final_df = df.loc[df["response"] == "Yes"]

In [31]:
#final_df.groupby("sales_channel").agg({"response": "count"})

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [32]:
# your code goes here
df["month"] = df["effective_to_date"] = df["effective_to_date"].apply(lambda x: x.split("/")[0])
bonus_df = df.groupby(["state", "month"]).agg({"number_of_policies": "count"}).reset_index()
pivot_df = bonus_df.pivot(index="state", columns="month", values="number_of_policies")
pivot_df

month          1     2
state
Arizona     1008   929
California  1918  1634
Nevada       551   442
Oregon      1565  1344
Washington   463   425

In [33]:
sorted_bonus_df = bonus_df.sort_values("number_of_policies", ascending=False)
sorted_bonus_df.reset_index()
top_3_df = sorted_bonus_df.iloc[:6].reset_index()
top_3_df.drop("index", axis=1)

        state month  number_of_policies
0  California     1                1918
1  California     2                1634
2      Oregon     1                1565
3      Oregon     2                1344
4     Arizona     1                1008
5     Arizona     2                 929

In [34]:
final_df = df.loc[df["response"] == "Yes"]
final_df = final_df.groupby("sales_channel").agg({"response": "count"})
final_df.rename(columns = {"response": "Affirmative_response"}, inplace=True)
final_df

               Affirmative_response
sales_channel
Agent                           742
Branch                          326
Call Center                     221
Web                             177